import Diamant from "./diamant/Diamant"
import DiamantImg from "./diamant/Image.png"
import SkullImg from "./skull/Image.png"

export const Games = [
    {
        Name: "Diamant",
        Description: "«Диамант» — это простая и увлекательная настольная игра, в которой игрокам предстоит исследовать пещеры, собирать сокровища и реликвии, а также избегать ловушек.",
        Image: DiamantImg,
        JSX: Diamant,
        Rule:
            <ol>
                <li>
                    Каждый игрок выставляет на основной планшет фишку своего цвета.
                </li>
                <li>
                    Он берёт сундук для хранения своих богатств и две карты для голосования: «Иду дальше» и «Возвращаюсь в лагерь».
                </li>
                <li>
                    Игра длится пять раундов, каждый раунд приключенцы исследуют новую пещеру.
                </li>
                <li>
                    Один за одним случайно из общей колоды достается и выкладывается тайл.Тайлы бывают двух типов: тайлы с сокровищами и тайлы с ловушками.
                </li>
                <li>
                    Если выходит тайл с сокровищами, то игроки равномерно распределяют эти сокровища, а остаток кладётся на сам тайл.
                </li>
                <li>
                    Если выходит тайл с ловушкой, которая ещё не выходила в текущем раунде, ничего не происходит.
                </li>
                <li>
                    Если выходит ловушка, на которую искатели сокровищ уже натыкались, они убегают, теряя все сокровища, накопленные за этот раунд.
                </li>
                <li>
                    После выхода каждого тайла игроки начинают голосовать.Игрок может либо рискнуть и продолжить путешествие, чтобы «нахапать» побольше сокровищ, либо отправиться обратно в лагерь.
                </li>
                <li>
                    Если несколько игроков отправляются обратно в лагерь, то они делят сокровища, оставленные до этого на предыдущих тайлах.
                </li>
                <li>
                    Все игроки, кто добровольно вернулся в лагерь, кладут добытые богатства в свой сундук.Это их победные очки до конца игры, никто не может их отобрать.
                </li>
                <li>
                    Как только все игроки вернулись в лагерь(добровольно или сбежав от опасности), тайлы замешиваются заново и начинается новый раунд.
                </li>
                <li>
                    По окончании пятого раунда игроки считают победные очки.Набравший больше всех победных очков игрок побеждает.
                </li>
            </ol>
    },
    {
        Name: "Skull",
        Description: "«Описание Skull»",
        Image: SkullImg,
        JSX: Diamant,
        Rule: "Правила Skull"
    }
]

